---
kind: method
id: M:Autodesk.Revit.DB.SATImportOptions.#ctor
source: html/7053066d-9b6f-4012-42b6-60133e2db38e.htm
---
# Autodesk.Revit.DB.SATImportOptions.#ctor Method

Constructs a new instance of SATImportOptions with default values of all properties.

## Syntax (C#)
```csharp
public SATImportOptions()
```